Revit 2027 API
ViewNavigationToolSettings.GetViewNavigationToolSettings Method
 Gets the instance of the settings for the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewNavigationToolSettings GetViewNavigationToolSettings(
	Document pADoc
)
Public Shared Function GetViewNavigationToolSettings (
	pADoc As Document
) As ViewNavigationToolSettings
public:
static ViewNavigationToolSettings^ GetViewNavigationToolSettings(
	Document^ pADoc
)
static member GetViewNavigationToolSettings :
        pADoc : Document -> ViewNavigationToolSettings
Parameters
pADoc Document
 The document.
Return Value
ViewNavigationToolSettings
 The instance of the settings for the given document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace